request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getPlanesRequest>
         <gs:estado>1</gs:estado>
      </gs:getPlanesRequest>
   </soapenv:Body>
</soapenv:Envelope>
